---
kind: method
id: M:Autodesk.Revit.DB.FilledRegionType.IsValidLineWeight(System.Int32)
source: html/36e69e7b-4bb3-b27a-f8e0-7d2afc3baf3a.htm
---
# Autodesk.Revit.DB.FilledRegionType.IsValidLineWeight Method

Indicates whether the given line weight value is valid.

## Syntax (C#)
```csharp
public static bool IsValidLineWeight(
	int lineWeight
)
```

## Parameters
- **lineWeight** (`System.Int32`) - The line weight.

## Returns
True if it is a valid line weight value, false otherwise.